Revit 2027 API
TextEditorOptions.ShowBorder Property
 Show the border box around the text during editing.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowBorder { get; set; }
Public Property ShowBorder As Boolean
	Get
	Set
public:
property bool ShowBorder {
	bool get ();
	void set (bool value);
}
member ShowBorder : bool with get, set
Property Value
Boolean
Remarks
 If false, the border will appear or not depending on the edited text note's type Show Border setting. If true, the border will always appear during editing regardless of type settings.
See Also
Reference
TextEditorOptions Class
Autodesk.Revit.UI Namespace